# coding=utf-8
from pyecharts import options as opts
from pyecharts.charts import WordCloud
from pyecharts.globals import SymbolType

# 数据
words = [
    ('闪退',10947),
    ('软件',5278),
    ('一直',4247),
    ('学习',4149),
    ('没有',2479),
    ('什么',2372),
    ('视频',2218),
    ('不能',2177),
    ('更新',2146),
    ('这个',2121),
    ('真的',2114),
    ('为什么',2086),
    ('好评',1812),
    ('进不去',1728),
    ('显示',1659),
    ('课程',1567),
    ('下载',1433),
    ('问题',1381),
    ('差评',1339),
    ('一星',1333),
    ('垃圾',1298),
    ('进度',1250),
    ('五星',1243),
    ('老师',1232),
    ('打不开',1192),
    ('一下',1151),
    ('不了',1137),
    ('上课',1136),
    ('加载',1101),
    ('修复',1071),
    ('就是',1062),
    ('不想',1026),
    ('出来',1010),
    ('不好',943),
    ('手机',933),
    ('课时',807),
    ('时间',792),
    ('重新',747),
    ('分期',742),
    ('作业',725),
    ('进度条',720),
    ('时长',666),
    ('记录',664),
    ('解决',624),
    ('分期付款',597),
    ('不错',590),
    ('不行',564),
    ('系统',562),
    ('电脑',529),
    ('喜欢',525),
    ('登录',472),
    ('卡死',452),
    ('啊啊啊',436),
    ('卸载',429),
    ('一次',424),
    ('小时',423),
    ('太卡',417),
    ('大学',415),
    ('崩溃',410),
    ('一颗',403),
    ('bug',373),
    ('好用',370),
    ('完成',364),
]

# 渲染图
def wordcloud_base() -> WordCloud:
    c = (
        WordCloud()
        .add("", words, word_size_range=[20, 100], shape='diamond')  # SymbolType.ROUND_RECT
        .set_global_opts(title_opts=opts.TitleOpts(title='WordCloud词云'))
    )
    return c

# 生成图
wordcloud_base().render('词云图.html')
